import classes

def guidelines(): """

Στο main-3399.py βρίσκεται το κύριο πρόγραμμα ενώ στο classes.py βρίσκονται οι κλάσεις 
SakClass, Player, Human, Computer και Game.

Στην κλάση SakClass γίνονται οι ζητούμενοι μέθοδοι: 

getletters όπου επιστρέφει Ν πλήθος γραμμάτων τα οποία θα 
επιλεχθούν τυχαία από το σακουλάκι

putbackletters όπου επιστρέφει κάποια γράμματα στο σακουλάκι 

randomize_sak αρχικοποιεί το σακουλάκι κάθε φορά που ξεκινάει παρτίδα. 

Δημιουργούνται δύο λεξικά εντός της κλάσης , ένα για τα
γράμματα με την αξία τους και ένα για τα γράμματα με το πόσες φορές υπάρχουν στο σακουλάκι.

Οι αλγόριθμοι για τον υπολογιστή είναι οι min-max-smart .

Δημιουργούνται συναρτήσειςγια υπολογισμό σκορ κάθε λέξης (score_word), συνάρτηση ώστε να έχει πάλι 7 στο ταμπλό του (replace_word),
init_table και show_table για το ταμπλό του παίκτη και correct_word για το αν η συνάρτηση ανήκει στο λεξικό (greek7).

Η κλάση Human  αποτελείται από τη συνάρτηση play η οποία καλείται στη run της κλάσης Game

Η κλάση Computer
    αφορά τον υπολογιστή η οποία μπορεί να παίζει στα 3 σενάρια min, max, smart με
    default τιμή αυτό του min και η play η οποία καλείται στη run της Game κάθε φορά που είναι η σειρά του Η/Υ να παίξει 

Οι αλγόριθμοι min, max και smart λειτουργούν όπως στην εκφώνηση,
    δημιουργούνται δηλαδή μεταθέσεις των γραμμάτων του ταμπλό με χρήση permutations μέχρι να βρεθεί η πρώτη αποδεκτή λέξη. 
 Σε περίπτωση που δε βρεθεί λέξη επιστρέφει μήνυμα τέλους

Κλάση Game: Στον κατασκευαστή της γίνεται και άνοιγμα του αρχείου json για τα στατιστικά. Γίνεται έλεγχος για το σωστό άνοιγμα 
    init_file. Η κλάση Game περιέχει τη συνάρτηση setup η οποία αφορά το interface κυρίως καθώς
    εμφανίζει το main menu και ελέγχει για τη σωστή επιλογή γραμμάτων από το μενού. Η συνάρτηση run καλεί τη setup για εμφάνιση του μένου και ξεκινά το παιχνίδι.
    Όταν λοιπόν επιστρέφεται 'end' καλείται η συνάρτηση end η οποία εκτυπώνει τα αποτελέσματα

   
   """

p=classes.Game()
p.run()





